-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 13, 2020 at 02:53 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test_app`
--

-- --------------------------------------------------------

--
-- Table structure for table `cart`
--

CREATE TABLE `cart` (
  `PID` int(8) NOT NULL,
  `OrderID` int(10) NOT NULL,
  `amount` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `cart`
--

INSERT INTO `cart` (`PID`, `OrderID`, `amount`) VALUES
(0, 13, 0),
(0, 14, 0),
(0, 15, 0),
(0, 16, 0),
(1119, 17, 4);

-- --------------------------------------------------------

--
-- Table structure for table `company`
--

CREATE TABLE `company` (
  `MID` int(8) NOT NULL,
  `comp_name` varchar(100) DEFAULT 'Unknown Company',
  `comp_rep_name` varchar(100) DEFAULT 'Not represent yet'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `MID` int(8) NOT NULL,
  `MPassword` varchar(100) NOT NULL,
  `adress` varchar(200) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `phone` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`MID`, `MPassword`, `adress`, `email`, `phone`) VALUES
(4, '123456', '33/6', 'eaf@gmail.com', '0826776197');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `OrderID` int(10) NOT NULL,
  `paymentMethod` varchar(100) DEFAULT 'Pay on delivery',
  `shippingMethod` varchar(100) DEFAULT 'EMS',
  `shippingCost` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `person`
--

CREATE TABLE `person` (
  `MID` int(8) NOT NULL,
  `citizenID` int(13) NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `person`
--

INSERT INTO `person` (`MID`, `citizenID`, `name`) VALUES
(3, 2147483647, 'eaffy');

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `PID` int(8) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `description` varchar(200) DEFAULT NULL,
  `price` float DEFAULT NULL,
  `PImage` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`PID`, `name`, `description`, `price`, `PImage`) VALUES
(1111, 'สว่านกระแทก 1/2 นิ้ว รุ่น GSB 550 FISHERMAN BOX', 'กำลังไฟ: 550 วัตต์ ความเร็วรอบ: 0-2,800 รอบ/นาที อัตรากระแทก: 0-41,800 ครัง้ /นาที เจาะปูนสูงสุด: 13 มม.ขนาดหัวจับดอก: 13 มม.', 1700, 'image/1.jpg'),
(1112, 'ชุดสว่านกระแทก 1/2 นิ้ว รุ่น STDH7213V-B1TH', 'กำลังไฟฟ้าสินค้า 720 วัตต์\n- แรงดันไฟฟ้า : 220 V\n- ความถี่ : 50/60Hz\n- ความเร็วขณะไม่มีโหลด : 3000 min\n- อัตราการเจาะกระแทก 54000 TW\n- การหมุนย้อนกลับ/การหมุนไปด้านหน้า : มี\n- ขนาดหัวจับดอกสว่าน 1.5 -', 2500, 'image/2.jpg'),
(1113, 'สว่านไฟฟ้า ขนาด 3/8 นิ้ว รุ่น ET10KD', ' ใช้สำหรับงานเจาะไม้และเหล็ก\n- สามารถใช้เป็นไขควงไฟฟ้าได้ โดยการปรับหมุนทิศทางตามเข็ม และทวนเข็มนาฬิกา\n- ควบคุมความเร็วรอบด้วยการกด สวิทช์หนัก-เบา\n- มีปุ่มล็อคสวิทช์ค้างเมื่อต้องการให้สว่านหมุนตลอด\n- ', 1000, 'image/3.jpg\r\n'),
(1114, 'สว่านไฟฟ้า 1/4 นิ้ว รุ่น MX651', 'สว่านไฟฟ้า(ELECTRIC DRILL) ผลิตจากเหล็กที่มีคุณภาพดี\n- ด้ามจับแบบนุ่มออกแบบตามหลักสรีรศาสตร์\n- สวิตช์ใช้งานง่าย พร้อมระบบควบคุมความเร็วแบบอิเล็กทรอนิกส์\n- มีความแข็งแรง ทนทาน\n- ผ่านกระบวนการผลิตที่ด้ว', 499, 'image/4.jpg'),
(1115, 'หัวสว่านและข้อต่อ 1/2 นิ้ว', 'ผลิตจากเหล็กกล้าที่มีคุณภาพดี\n- มีความเหนียว มีความแข็งแรง ทนทาน\n- ออกแบบได้สวยงาม\n- พร้อมการผลิตที่ประณีตด้วยเครื่องจักรที่ทันสมัย\n- ใช้เป็นอะไหล่ของสว่าน สว่านไฟฟ้า\n- เป็นแบบมือบิดขันล็อคดอกสว่าน สะ', 150, 'image/5.jpg'),
(1116, 'หัวสว่าน 3/8 นิ้ว', 'ผลิตจากเหล็กกล้าที่มีคุณภาพดี\n- มีความเหนียว มีความแข็งแรง ทนทาน\n- ออกแบบได้สวยงาม\n- พร้อมการผลิตที่ประณีตด้วยเครื่องจักรที่ทันสมัย\n- ใช้เป็นอะไหล่ของสว่าน สว่านไฟฟ้า\n- เป็นแบบมือบิดขันล็อคดอกสว่าน สะ', 115, 'image/6.jpg'),
(1117, 'หัวสว่าน 1/4 นิ้ว', 'ผลิตจากเหล็กกล้าที่มีคุณภาพดี\n- มีความเหนียว มีความแข็งแรง ทนทาน\n- ออกแบบได้สวยงาม\n- พร้อมการผลิตที่ประณีตด้วยเครื่องจักรที่ทันสมัย\n- ใช้เป็นอะไหล่ของสว่าน สว่านไฟฟ้า\n- เป็นแบบมือบิดขันล็อคดอกสว่าน สะ', 110, 'image/7.jpg'),
(1118, 'สว่านโรตารี่ รุ่น M8701B', 'สว่านโรตารี่(ROTARY HAMMERS) ภายนอกตัวเครื่องผลิตจากพลาสติกที่มีคุณภาพดี\n- ขนาดที่เล็กกะทัดรัดช่วยให้ใช้งานสะดวกสบาย\n- สวิทต์เปิด-ปิดขนาดใหญ่และมีปุ่มล็อกการทำงานต่อเนื่อง\n- ผ่านกระบวนการผลิตด้วยเครื่', 2700, 'image/8.jpg'),
(1119, 'สว่านไร้สายพร้อมไฟฉาย 12 โวลต์ รุ่น BS12-C2KIT', 'สว่านไร้สาย (CORDLESS DRILL) ตัวเครื่องผลิตจากเหล็กที่มีคุณภาพดี\n- มีขนาดกะทัดรัด ถือได้ง่ายและทำงานได้สะดวก\n- สามารถปรับซ้าย-ขวาได้ สำหรับการขันและคลายสกรู\n- ด้ามจับออกแบบตามหลักสรีรศาสตร์เหมาะมือใช้', 4500, 'image/9.jpg'),
(1120, 'สว่านกระแทก รุ่น HP-1630KSP', 'เหมาะสำหรับกระแทกอิฐ, คอนกรีต, หิน, และใช้สำหรับเจาะไม้, โลหะ, เซรามิค, พลาสติก\n- ออกแบบตามหลักสรีระศาสตร์ มือจับหุ้มยาง จับได้กระชับ\n- มอเตอร์ถูกออกแบบให้เป็นทรงกระบอก มีความทนทาน แข็งแรง\n- สามารถใช้', 2550, 'image/10.jpg'),
(1121, 'สว่านไร้สาย 4 โวลต์ รุ่น SD4 ELI', 'ด้ามจับออกแบบตามหลักสรีรศาสตร์เหมาะมือใช้งานสะดวก\n- มีขนาดกะทัดรัด ถือได้ง่ายและทำงานได้สะดวก\n- ด้ามจับออกแบบให้กันลื่น ผลิตด้วยวัสดุอย่างดี\n- เหมาะสำหรับไขสกรู งานเบาๆ ภายในครัวเรือนด้วยตัวคุณเอง\n- เ', 1200, 'image/11.jpg'),
(1122, 'สว่านกระแทก 5/8 นิ้ว รุ่น J-1630', 'สว่านกระแทก (HAMMER DRILL) ตัวเครื่องผลิตจากเหล็กที่มีคุณภาพดี\n- สว่านกระแทก สำหรับงานเจาะ ขันสกรู และเจาะกระแทก\n- เสียงเฟืองนิ่ม เพราะตัวเฟืงผลิตจากวัสดุเนื้อดี ด้วยเครื่องจักรอัตโนมัติ\n- ปรับหมุนได้', 1550, 'image/12.jpg'),
(1123, 'BOSCH สว่านโรตารี่ รุ่น GBH2-26DFR', 'ความสามารถในการเจาะสูง อัตราการเจาะเหนือกว่าสว่านกระแทกรุ่น 2 กก. ทั่วไป\n- มาพร้อมมอเตอร์ขนาด 800 W กำลังสูงที่ถูกออกแบบมาให้ใช้งานได้หนัก และ ทนทานกว่าเครื่องทั่วไป\n- รองรับการเจาะสามรูปแบบ ได้แก่ กา', 8500, 'image/13.jpg'),
(1124, 'สว่านไฟฟ้า 1/4 นิ้ว รุ่น EU653', 'สว่านไฟฟ้า (ELECTRIC DRILL) โครงสร้างภายนอกผลิตจากวัสดุที่มีคุณภาพดี\n- ด้ามจับแบบนุ่มออกแบบตามหลักสรีรศาสตร์ เพื่อการเจาะที่ไม่เมื่อยล้า\n- สามารถปรับซ้าย-ขวาได้\n- มีความแข็งแรง ทนทาน ประสิทธิภาพสูง ใช', 800, 'image/14.jpg'),
(1125, 'อะไหล่สว่านไฟฟ้า สวิตซ์ รุ่น DS2651', ' เหมาะสำหรับปรับเปลี่ยนเมื่อสวิตซ์สว่านไฟฟ้า รุ่น DS2651 NASH สึกหรอหรือชำรุดเสียหาย', 145, 'image/15.jpg'),
(1126, 'สว่านโรตารี่ รุ่น BR24SRE', 'ขนาดที่เล็กกะทัดรัดช่วยให้ใช้งานสะดวกสบาย\n- สว่านโรตารี่(ROTARY HAMMERS) ภายนอกตัวเครื่องผลิตจากพลาสติกที่มีคุณภาพดี\n- สวิทต์เปิด-ปิดขนาดใหญ่และมีปุ่มล็อกการทำงานต่อเนื่อง\n- ผ่านกระบวนการผลิตด้วยเครื่', 2500, 'image/16.jpg'),
(1127, 'สว่านไฟฟ้า 1/4 นิ้ว รุ่น DS2651', 'สว่านไฟฟ้า (ELECTRIC DRILL) ผลิตจากเหล็กที่มีคุณภาพดี\n- มีความแข็งแรง ทนทาน สามารถใช้งานได้ยาวนาน\n- สวิตช์ใช้งานง่าย พร้อมระบบควบคุมความเร็วแบบอิเล็กทรอนิกส์\n- มีระบบล็อคสำหรับความปลอดภัยของผู้ใช้งาน\n', 480, 'image/17.jpg'),
(1128, 'สว่านโรตารี่ รุ่น RH-2609 สีแดง', 'สว่านโรตารี่(ROTARY HAMMERS) ภายนอกตัวเครื่องผลิตจากพลาสติกที่มีคุณภาพดี\n- สวิทต์เปิด-ปิดขนาดใหญ่และมีปุ่มล็อกการทำงานต่อเนื่อง\n- ขนาดที่เล็กกะทัดรัดช่วยให้ใช้งานสะดวกสบาย\n- ผ่านกระบวนการผลิตด้วยเครื่', 1690, 'image/18.jpg'),
(1129, 'เครื่องกวนสี รุ่น DS621502', 'กำลังไฟฟ้าเข้า : 1050 วัตต์\n- แรงดันไฟฟ้า : 220-240V 50/60Hz\n- ความเร็วรอบ : 0-580 รอบ/นาที\n- ผสมสีได้สูงสุด : 120 มม.\n- Drill Capacity : 13 มม.\n- ใช้สำหรับผสม/กวนเคมีและของเหลวทุกชนิด\n- ใช้งานสะดวกรว', 2600, 'image/19.jpg'),
(1130, 'สว่านไขควง 4.8 โวลต์ รุ่น LT-80435', 'ผลิตจากเหล็กที่มีคุณภาพดี\n- มีความแข็งแรง ทนทาน\n- ใช้สำหรับเป็นสว่านเจาะ และเป็นไขควงไฟฟ้า\n- ใช้งานร่วมกับดอกหัวไขควงและดอกเจาะต่างๆ ที่มีแกนหัวสวมเร็ว\n- มีระบบกระแทกในตัวช่วยผ่อนแรงในการไข เมื่อไขสุด', 379, 'image/20.jpg'),
(1131, 'เครื่องเจียร 4 นิ้ว รุ่น GWS-060', 'ส่วนหัวของเครื่องมือเป็นแบบเรียบสำหรับการทำงานในพื้นที่จำกัด\n- ส่วนหัวของเครื่องมือหมุนได้ครั้งละ 90°\n- มอเตอร์พร้อมระบบป้องกันฝุ่นช่วยป้องกันเศษเจียรที่คม\n- ฝาครอบป้องกันการสะบัด\n- ปรับได้ง่าย ป้องกั', 989, 'image/21.jpg'),
(1132, 'STANLEY เครื่องเจียร์ 4 นิ้ว 1050 วัตต์ รุ่น SGT104-B1', 'กำลังไฟสินค้า 1050 วัตต์\n- แรงดันไฟฟ้า : 220-240V\n- ความถี่ : 50/60Hz\n- ความเร็วขณะไม่มีโหลด : 12000 min\n- ขนาดของแผ่นเจียร์ : 4 นิ้ว\n- ความหนาของแผ่นเจียร์ : 6 มม.\n- เส้นผ่าศูนย์กลางของแกนหมุน : m10\n', 1659, 'image/22.jpg'),
(1133, 'INGCO เครื่องเจียร์ 710 วัตต์ ขนาด 4 นิ้ว รุ่น AG7106-2', 'เครื่องเจียร (GRINDER) เครื่องเจียรผลิตและออกแบบให้แข็งแรงทนทาน รองรับงานช่างได้เป็นอย่างดี\n- ตัวเครื่องเจียรผลิตจากวัสดุที่มีคุณาพดี แข็งแรง ทนทาน\n- ออกแแบบรูปทรงให้แข็งแรงดูทันสมัยและเข้ากับสรีระศาส', 840, 'image/23.jpg'),
(1134, 'NUMSTAR เครื่องขัดสี', 'ประสิทธิภาพสูงขัดลบรอยและขัดชักเงาได้ดี\n- ใช้งานร่วมกับ ชุดฟองน้ำขัดสี แผ่นขัดขนแกะขนฟู\n- มีความปลอดภัยต่อสีรถมาก เหมาะสำหรับขัดเคลือบสีรถใหม่และรถที่สภาพสีมีริ้วรอยน้อย\n- ตัวเครื่องน้ำหนักเบา ช่วยทุ่', 1339, 'image/24.jpg'),
(1135, 'MAKITA เครื่องเจียร 9 นิ้ว รุ่น GA9060', 'เครื่องเจียร ปุ่มล็อคแกนหมุนขนาดใหญ่เพื่อความสะดวกในการเปลี่ยนล้อขณะใส่ถุงมือ\n- มือจับทำจากยางแบบนิ่ม ช่วยเพิ่มความสบายและง่ายต่อการควบคุม\n- มีฉนวนหุ้ม 2 ชั้น ป้องกันอันตรายจากไฟฟ้า\n- ตัวครอบขั้วสวิทซ', 4199, 'image/25.jpg'),
(1136, 'MAKTEC เครื่องเจียร 9 นิ้ว รุ่น MT903', 'เครื่องเจียร (GRINDER) เครื่องเจียรผลิตจากวัสดุคุณภาพดี แข็งแรง ทนทาน ใช้งานได้ยาวนาน\n- ด้ามจับใช้ยางแบบพิเศษ เพื่อช่วยในการจับให้ถนัดมือและไม่ลื่นขณะใช้งาน\n- ออกแแบบรูปทรงให้แข็งแรงดูทันสมัย และเข้าก', 3460, 'image/26.jpg'),
(1137, 'NASH อะไหล่เครื่องขัด ทุ่น รุ่น DS5021', 'COMMUTATOR ทำจากทองแดงอย่างดี\n- ขดลวดเคลือบด้วยน้ำยาอย่างหนา 3 ชั้น ป้องกันฝุ่นละออง\n- เลือบฉนวนกันลวดขยายตัว และช่วยระบายอากาศได้ดี\n- เหมาะสำหรับปรับเปลี่ยนเมื่อทุ่นเครื่องขัดรุ่น DS-5021 NASH สึกหรอ', 455, 'image/27.jpg'),
(1138, 'NASH อะไหล่เครื่องกวนสี ทุ่น รุ่น DS621501', 'COMMUTATOR ทำจากทองแดงอย่างดี\n- ขดลวดเคลือบด้วยน้ำยาอย่างหนา 3 ชั้น ป้องกันฝุ่นละออง\n- เลือบฉนวนกันลวดขยายตัว และช่วยระบายอากาศได้ดี\n- เหมาะสำหรับปรับเปลี่ยนเมื่อทุ่นเครื่องกวนสี รุ่น DS621501 NASH สึ', 920, 'image/28.jpg'),
(1139, 'NASH อะไหล่เครื่องกวนสี แปรงถ่าน รุ่น DS621501', 'เหมาะสำหรับปรับเปลี่ยนเมื่อแปรงถ่านเครื่องกวนสี รุ่น DS621501 NASH สึกหรอหรือชำรุดเสียหาย\n- สามารถหล่อลื่นได้เองและทนต่อรอยขีดข่วนได้ดีเยี่ยม\n', 80, 'image/29.jpg'),
(1140, 'NASH เครื่องเจียร 7 นิ้ว รุ่น DS6180S', ' เครื่องเจียร (GRINDER) เครื่องเจียรผลิตและออกแบบให้แข็งแรงทนทาน รองรับงานช่างได้เป็นอย่างดี\n- ตัวเครื่องเจียรผลิตจากวัสดุที่มีคุณาพดี แข็งแรง ทนทาน\n- ออกแแบบรูปทรงให้แข็งแรงดูทันสมัยและเข้ากับสรีระศา', 2860, 'image/30.jpg'),
(1141, 'NASH เครื่องเจียร์ 9 นิ้ว รุ่น DS-6230S', 'เครื่องเจียร (GRINDER) เครื่องเจียรผลิตและออกแบบให้แข็งแรงทนทาน รองรับงานช่างได้เป็นอย่างดี\n- ตัวเครื่องเจียรผลิตจากวัสดุที่มีคุณาพดี แข็งแรง ทนทาน\n- ออกแแบบรูปทรงให้แข็งแรงดูทันสมัยและเข้ากับสรีระศาส', 2050, 'image/31.jpg'),
(1142, '3M แป้นจับจานขัดสก๊อตช์ไบรต์ 4 นิ้ว', 'แข็งแรงทนทานขัดได้นาน สก๊อตไบรต์ ขัดสะอาด ตัวแปรงสามารถเข้าซอกซอนทำความสะอาดได้เป็นอย่างดี\n- เพิ่มประสิทธิภาพในการขัดแต่งผิวงานหลังงานเชื่อม\n- ลดขั้นตอนการเจียรประหยัดเวลา และได้ผิวงานที่สวยงามในขั้นต', 378, 'image/32.jpg'),
(1143, 'BOSCH แปรงถ่าน รุ่น GWS 7-100', 'แปรงถ่าน(CARBON BRUSH) คือ ตัวสัมผัสกับคอมมิวเตเตอร์ หรือเป็นอุปกรณ์ที่ทำหน้าที่นำกระแสไฟฟ้าบน commutator หรือ slip ring\n- ทำจากส่วนผสมของทองแดง และ กราไฟต์\n- มีความแข็งแรง ทนทานที่ดี\n- หล่อลื่นได้เอง', 259, 'image/33.jpg'),
(1144, 'กระเบื้องพื้น 16X16 ล็อคโฮม. น้ำตาล A 1M2', 'กระเบื้องพื้นสีน้ำตาล เลียนแบบลายไม้เสมือนจริง สามารถทำความสะอาดได้อย่างง่ายดาย และช่วยเพิ่มความสวยงามโดดเด่นให้กับพื้นบ้านของคุณได้อย่างดีเยี่ยม', 199, 'image/34.jpg'),
(1145, 'กระเบื้องพื้น COTTO สเตฟาน EXC 12X12 นิ้ว สีเบจ', 'ลายหินอ่อนแกรนิตภายใน มีเอกลักษณ์เฉพาะตัว สวยงามเหมือนธรรมชาติ\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และการขูดขีด\nง่ายต่อการทำความสะอาด\nวิธีใช้งาน', 159, 'image/35.jpg'),
(1146, 'กระเบื้องพื้น 16x16 นิ้ว ฟิวส์ วู๊ด 1M2 EXC PM', 'ผลิตจากเซรามิกมีความแข็งแรง ทนทาน ลวดลายมีเอกลักษณ์เฉพาะตัว มีความสวยงามเหมือนธรรมชาติ\nลักษณะพื้นผิวกระเบื้องมีลักษณะกึ่งขัดเงา เหมาะสำหรับการปูพื้นทั่วไปภายนอกและภายในอาคารที่พักอาศัย\nรองรับน้ำหนักได', 175, 'image/36.jpg'),
(1147, 'กระเบื้องพื้น 16X16 อาคาเดีย ขาว . 1M2', 'ลายหินอ่อนแกรนิตภายใน มีเอกลักษณ์เฉพาะตัว สวยงามเหมือนธรรมชาติ\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และการขูดขีด\nพื้นผิวมัน ง่ายต่อการทำความสะอาด', 179, 'image/37.jpg'),
(1148, 'กระเบื้องพื้น 40X40CM ไม้ภูผา น้ำตาล . 1M2', 'พื้นผิวกึ่งมันกึ่งด้าน เรียบ ไม่มันวาว\nลายหินอ่อนแกรนิตภายใน มีเอกลักษณ์เฉพาะตัว สวยงามเหมือนธรรมชาติ\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และการขูดขีด', 179, 'image/38.jpg'),
(1149, 'กระเบื้องพื้น 16X16 สไตรปพ์ วู๊ด ฟ้า PM 1M2', 'พื้นผิวเป็นกระเบื้องด้าน ลายไม้เสมือนจริง\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และการขูดขีด\nทำความสะอาดได้ง่าย', 205, 'image/39.jpg'),
(1150, 'กระเบื้องพื้น 16X16 เซ็นโตซ่า เบจ A 1M2', 'ลักษณะพื้นผิวกระเบื้องเนื้อแมท ลวดลายมีเอกลักษณ์เฉพาะตัว มีความสวยงามเหมือนธรรมชาติ\nผลิตจากเซรามิคมีความแข็งแรง ทนทาน รองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และ การขูดขีด\nง่ายต่อการทำความสะอาด', 185, 'image/40.jpg'),
(1151, 'กระเบื้องพื้น 40X40 ซม. เซเลน่า คัลเลอร์ ฟลู', 'กระเบื้องผลิตจากเซรามิกผ่านกระบวนการเผาจนมีความแข็งแกร่ง และทนทาน\nผิวกระเบื้องลวดลายกราฟิกแบบต่อลาย สามารถนำไปตกแต่งได้หลากหลายสไตล์\nด้านหลังของกระเบื้องจะมีความขรุขระ เพื่อให้เกิดการยึดเกาะพื้นที่ดี', 199, 'image/41.jpg'),
(1152, 'กระเบื้องพื้น 16X16 นิ้ว คูโบ้ เทา PM 1M2', 'กระเบื้องเซรามิกผลิตจากวัสดุจากธรรมชาติผ่านกระบวนการเผาจนมีความแข็งแกร่ง และทนทาน\nการดูดซึมน้ำไม่เกิน 6% รูพรุนภายในการเบื้องต่ำ สามารถนำไปใช้ในพื้นที่ที่ต้องรับน้ำหนักได้ดี\nลักษณะผิวหน้ากระเบื้องเป็น', 199, 'image/42.jpg'),
(1153, 'กระเบื้องพื้น 40x40 ซม. เรนนี่ ไวท์ 1M2', 'ลวดลายมีเอกลักษณ์เฉพาะตัว มีความสวยงามเหมือนธรรมชาติ ผิวหน้ามันเรียบ\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และ การขูดขีด ง่ายต่อการทำความสะอาด\nจำหน่ายเป็นกล่อง การบรรจุต่อกล่อง : 6 แผ่น/กล่อง', 179, 'image/43.jpg'),
(1154, 'ก/บพื้น 30X60CM. เนเน่ เบจ A 1.44M2', 'ผลิตมาจากวัสดุเซรามิกที่มีคุณภาพ แข็งแรง ทนทาน\nรองรับน้ำหนักได้ดี ทนต่อการเสียดสีและการขูดขีด\nลวดลายไม้ภายใน ไม่ตัดขอบ', 339, 'image/44.jpg'),
(1155, 'ก/บพื้น 60x60CM โมด้า วู้ด น้ำตาล . 1.44M2', 'กระเบื้องผลิตจากพอร์ซเลน มีความแข็งแกร่ง และทนทานสูง\nผิวกระเบื้องชนิดมีลวดลายไม้ เป็นแบบต่อลาย สามารถนำไปตกแต่งได้หลากสไตล์\nขนาดต่อแผ่น (กว้าง x สูง x ลึก) 60 x 60 x 1 ซม.', 529, 'image/45.jpg'),
(1156, 'กระเบื้องพื้น 16X16 นิ้ว เบสโต้ โบน ขาว PM', 'ผลิตจากวัสดุเซรามิกคุณภาพดี ทนทาน แข็งแกร่ง ไม่เปราะง่าย\nด้วยลวดลายหินอ่อน และ สัมผัสผิวกระเบื้องเป็นลวดลายอิฐเรียง Herring Bone แบบเหมือนจริง\nใช้ปูได้ทั้งภายนอกและภายในอาคาร ทนต่อสภาพอากาศและสารเคมี ', 209, 'image/46.jpg'),
(1157, 'กระเบื้องพื้น 16X16 นิ้ว บัวโนส เหลือง EXC PM', 'ผลิตจากวัสดุเซรามิกคุณภาพ ผ่านเทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแรง ทนทาน ต่อสภาพอากาศที่เปลี่ยนแปลงได้เป็นอย่างดี\nผิวกระเบื้องชนิดไม่ตัดขอบ ผิวเคลือบ Matt เรียบเนียน ไม่ลื่น\nใช้สำหรับปูพื้นภายใ', 205, 'image/47.jpg'),
(1158, 'กระเบื้องพื้น 18X18 นิ้ว ไมโอ น้ำตาล EXC PM', 'ผลิตจากวัสดุเซรามิกคุณภาพ ผ่านเทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแรง ทนทาน ต่อสภาพอากาศที่เปลี่ยนแปลงได้เป็นอย่างดี\nกระเบื้องผิวด้านชนิดไม่ตัดขอบ และมีมิติความนูนของลวดลายสมจริง\nเคลือบลวดลายเป็นอ', 185, 'image/48.jpg'),
(1159, 'กระเบื้องพื้น 60x60 ซม. แกรนด์ มาโม ดำ 1.44M2', 'ผลิตจากเซรามิกเนื้อพอร์ซเลน หลอมเกาะกันจนแน่น ทำให้น้ำซึมผ่านได้ยาก มีอายุการใช้งานยาวนาน ทนรับน้ำหนักได้ดีกว่า\nเทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแรง ทนทาน ต่อสภาพอากาศที่เปลี่ยนแปลงได้เป็นอย่าง', 479, 'image/49.jpg'),
(1160, 'กระเบื้องพื้น 16X16 นิ้ว ลูเป้ น้ำตาล EXC PM', 'ผลิตจากวัสดุเซรามิกคุณภาพดี เทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแรง ทนทาน ต่อสภาพอากาศที่เปลี่ยนแปลงได้เป็นอย่างดี\nกระเบื้องชนิดไม่ตัดขอบ มีค่าดูดซึมน้ำต่ำ ลดการเกิดคราบด่าง\nกระเบื้องมีผิวเรียบมัน', 195, 'image/50.jpg'),
(1161, 'กระเบื้องพื้น 12X12 นิ้ว โมวิก ไลท์ บลู A 1M2', 'ผลิตจากวัสดุเซรามิกคุณภาพ ผ่านเทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแกร่ง ทนทาน\nรองรับน้ำหนักได้ดี ทนทานต่อการเสียดสี และการขูดขีด\nกระเบื้องชนิดไม่ตัดขอบ ผิวหน้ากระเบื้องด้าน และมีลวดลายกราฟิกที่สวย', 169, 'image/51.jpg'),
(1162, 'กระเบื้องพื้น 60x60 ซม. เพอลิโน่ ขาว 1.44M2', 'กระเบื้องปูพื้นพอร์ซเลน รุ่น เพอลิโน่ สีขาว\nวัสดุผลิตจากพอร์ซเลน เซรามิกเนื้อขาว จึงมีความแข็งแรง ทนต่อรอยขีดข่วนเสียดสี และรองรับน้ำหนักได้ดี\nเปอร์เซ็นการดูดซึมน้ำต่ำ เนื้อแน่น ยึดเกาะได้ดี มีอายุการ', 559, 'image/52.jpg'),
(1163, 'กระเบื้องพื้น 16X16 นิ้ว เวียงก้า น้ำตาล EXC PM', 'ผลิตจากวัสดุเซรามิกคุณภาพ ผ่านเทคโนโลยีการผลิตทำให้กระเบื้องมีความแข็งแรง ทนทาน ต่อสภาพอากาศที่เปลี่ยนแปลงได้เป็นอย่างดี\nกระเบื้องชนิดไม่ตัดขอบ มาพร้อมผิวสัมผัสแบบ matt และมีผิวสัมผัสของลวดลายที่มีมิต', 205, 'image/53.jpg'),
(1164, 'สีรองพื้นปูนเก่า 7 IN 1 15L', 'ช่วยเพิ่มการยึดเกาะระหว่างพื้นผิวและสีทับหน้า\nสามารถป้องกันแบคทีเรียและเชื้อราตะไคร่น้ำ\nปกปิดรอยแตกลายงา และช่วยปกป้องโครงสร้าง', 2599, 'image/54.jpg'),
(1165, 'สีรองพื้นโลหะ SUPERCOTE RD 1GL', 'ผลิตจากอัลขีดเรซินและผงสีเรดอ๊อกไซด์คุณภาพ\nเสริมสภาพผิวโลหะให้อยู่ในสภาพดีก่อนการทาสีทับหน้า\nป้องกันการเกิดสนิมของชิ้นงานนั้นๆ ให้ยาวนานยิ่งขึ้น', 465, 'image/55.jpg'),
(1166, 'สีรองพื้นปูนเก่า JOTASHIELDPRIMER 1GL', 'ป้องกันด่างจากผนัง\nยึดเกาะผนังเป็นเยี่ยม\nป้องกันน้ำเข้าสู่ผนัง', 599, 'image/56.jpg'),
(1167, 'สีรองพื้นโลหะ TOA RUSTTECH A + B 1 แกลลอน สีเทา', 'ใช้งานสะดวก แห้งเร้ว ลดระยะเวลาในการทำงาน\nทาทับสนิมเก่าได้ทันทีโดยไม่ต้องขัด ประหยัดเวลา\nใช้สีทับหน้าได้ทั้งสีน้ำมัน อีพ็อกซี่ โพลียูรีเทน', 1200, 'image/57.jpg'),
(1168, 'สีรองพื้นแดงกันสนิม TOA G1024 1 แกลลอน', 'ใช้งานสะดวก แห้งเร้ว ลดระยะเวลาในการทำงาน\nยึดเกาะพื้นผิวสูง ทาบนผิวโลหะได้ทุกประเภท\nผลิตจากอัลขีดเรซิ่นคุณภาพสูง ป้องกันสนิมได้ดี\nจำนวน:	\n	\n1\n', 499, 'image/58.jpg'),
(1169, 'โพลียูรีเทน ภายใน CHEMGLAZE #151 1K M1/4GL', 'โพลียูรีเทนทับหน้าสีใสสำหรับงานไม้ภายใน\nให้พื้นผิวด้านสนิท\nให้ความสวยงามของไม้ใบแบบ CONTEMPORARY', 849, 'image/59.jpg'),
(1170, 'สีย้อมไม้ BEGER #1909 สีไม้มะฮอกกะนี เงา 1 แกลลอน', 'เนื้อสีซึมลึกถึงเนื้อไม้ ยึดเกาะแน่นด้วยซูเปอร์เรซิ่น ฟิล์มสีไม่แตก ไม่หลุดล่อน\nไม้หายใจได้ ฟิล์มสีโปร่งแสง 100% โชว์ลายไม้ชัดเจนด้วย Crystal Clear\nป้องกันรังสี UV ทำให้สีไม่ซีดจาง พร้อมคุณสมบัติป้องก', 750, 'image/60.jpg'),
(1171, 'สีย้อมไม้ BEGER #1903 สีไม้สัก เงา 1 แกลลอน', 'เนื้อสีซึมลึกถึงเนื้อไม้ ยึดเกาะแน่นด้วยซูเปอร์เรซิ่น ฟิล์มสีไม่แตก ไม่หลุดล่อน\nไม้หายใจได้ ฟิล์มสีโปร่งแสง 100% โชว์ลายไม้ชัดเจนด้วย Crystal Clear\nป้องกันรังสี UV ทำให้สีไม่ซีดจาง พร้อมคุณสมบัติป้องก', 750, 'image/61.jpg'),
(1172, 'สีย้อมไม้ BEGER #2906 สีไม้มะค่า กึ่งเงา 1/4 แกลลอน', 'เนื้อสีซึมลึกถึงเนื้อไม้ ยึดเกาะแน่นด้วยซูเปอร์เรซิ่น ฟิล์มสีไม่แตก ไม่หลุดล่อน\nไม้หายใจได้ ฟิล์มสีโปร่งแสง 100% โชว์ลายไม้ชัดเจนด้วย Crystal Clear\nป้องกันรังสี UV ทำให้สีไม่ซีดจาง พร้อมคุณสมบัติป้องก', 309, 'image/62.jpg'),
(1173, 'สีย้อมไม้ BEGER #2910 สีไม้วอลนัท กึ่งเงา 1 แกลลอน', 'เนื้อสีซึมลึกถึงเนื้อไม้ ยึดเกาะแน่นด้วยซูเปอร์เรซิ่น ฟิล์มสีไม่แตก ไม่หลุดล่อน\nไม้หายใจได้ ฟิล์มสีโปร่งแสง 100% โชว์ลายไม้ชัดเจนด้วย Crystal Clear\nป้องกันรังสี UV ทำให้สีไม่ซีดจาง พร้อมคุณสมบัติป้องก', 750, 'image/63.jpg'),
(1174, 'แลกเกอร์ TOA T-5500 ด้าน 1/4 แกลลอน', 'ปริมาณเนื้อสีมาก ความเข้มข้นสูง ผสมใช้งานได้พื้นที่มาก\nฟิล์มสียืดหยุ่น ลายไม้ชัดเจน ลดการแตกลายงาของฟิล์มสี\nผ่านมาตรฐานความปลอดภัย EN71 จากประเทศยุโรป', 175, 'image/64.jpg'),
(1175, 'แชล็คทาไม้ ฉลาม เบอร์ 4 1 แกลลอน', 'แชล็คทาไม้ผ่านกระบวนการผลิตพิเศษ ให้เฉดสีนิ่ง สีไม่เพี้ยน\nฟิล์มสีขึ้นเงาง่าย โชว์ลายไม้ชัดเจนเป็นธรรมชาติ ไม่มีแตกลายงา\nเนื้อแชล็คเยอะ ฟิล์มสีโปร่งแสง เป็นได้ทั้งสีรองพื้นและย้อมสีไม้', 199, 'image/65.jpg'),
(1176, 'สีน้ำทาไม้ WOODGUARD 9100 1 แกลลอน', 'ผลิตจากอะคริลิกแท้ 100% ยึดเกาะแน่น ให้ฟิล์มสีทนทานกว่าสีน้ำมันถึง 3 เท่า\nสีเช็ดล้างทำความสะอาดง่าย ด้วยสเตนการ์ดเทคโนโลยี\nทนแดด ทนฝน และสภาพอากาศที่รุนแรงได้นานนับ 10 ปี', 850, 'image/66.jpg'),
(1177, 'สีสเปรย์ WIN #221 Light Grey 400CC', 'สีสเปรย์คุณภาพสูง\nแห้งเร็ว สวยทน มีความเงางามสูง\nยึดเกาะได้ดีบนทุกพื้นผิว', 69, 'image/67.jpg'),
(1178, 'สีสเปรย์ WIN #239 Deep Red 400CC', 'สีสเปรย์คุณภาพสูง\nแห้งเร็ว สวยทน มีความเงางามสูง\nยึดเกาะได้ดีบนทุกพื้นผิว', 69, 'image/68.jpg'),
(1179, 'สีสเปรย์ TOA #008 Orange 400CC', 'สีสเปรย์คุณภาพสูง\nแห้งเร็ว สวยทน มีความเงางามสูง\nยึดเกาะได้ดีบนทุกพื้นผิว', 89, 'image/69.jpg'),
(1180, 'สีสเปรย์ รองพื้นPYLAC130 เทา', 'เนื้อสีผลิตจากอะคริลิกคุณภาพสูง สามรถยึดเกาะได้ดี มีความเงางามสูง\nสำหรับใช้ทั้งภายใน และภายนอก\nแพ็คเกจกระป๋องพอดีมือ สามารถใช้งาน และพกพาได้สะดวก', 89, 'image/70.jpg'),
(1181, 'สีสเปรย์ TOA #028 Dawn Pink 400CC', 'สีสเปรย์คุณภาพสูง\nแห้งเร็ว สวยทน มีความเงางามสูง\nยึดเกาะได้ดีบนทุกพื้นผิว', 89, 'image/71.jpg'),
(1182, 'อะไหล่ลูกกลิ้งทาสีอะคริลิก SOMIC 7 นิ้ว', 'ล้างน้ำทำความสะอาดแล้วนำกลับมาใช้ซ้ำได้\nทาแล้วสีไม่กระเด็นเปรอะเปื้อน ไม่หยดย้อย\nด้ามจับกระชับมือ ทำงานง่ายและรวดเร็ว', 52, 'image/72.jpg'),
(1183, 'อะไหล่ลูกกลิ้งทาสีอะคริลิก SOMIC 10 นิ้ว', 'ล้างแล้วนำกลับมาใช้ซ้ำได้\nทาแล้วสีไม่กระเด็นเปรอะเปื้อน\nด้ามจับกระชับมือ ทำงานได้รวดเร็ว\n\n', 52, 'image/73.jpg'),
(1184, 'แปรงทาสี POLYESTER #FD05555 1.5 นิ้ว', 'ขนแปรงหนาไม่หลุดร่วงง่าย\nอุ้มสีได้ดี ประหยัดเวลาการทำงาน\nขนแปรงหนาไม่หลุดร่วงง่าย', 9, 'image/74.jpg'),
(1185, 'แปรงทาสี POLYESTER #FD05555 2 นิ้ว', 'ขนแปรงหนาไม่หลุดร่วงง่าย\nอุ้มสีได้ดี ประหยัดเวลาการทำงาน\nขนแปรงหนาไม่หลุดร่วงง่าย', 15, 'image/75.jpg'),
(1186, 'แปรงทาสี POLYESTER #FD05555 4 นิ้ว', 'ขนแปรงหนาไม่หลุดร่วงง่าย\nอุ้มสีได้ดี ประหยัดเวลาการทำงาน\nขนแปรงหนาไม่หลุดร่วงง่าย', 35, 'image/76.jpg'),
(1187, 'กระดาษกาวรองทาสี SCOTCH 1 นิ้วX60Y', 'ขอบกระดาษคมไม่ขาดง่าย ตัดขอบได้เรียบ มองเห็นชัดเจน\nกาวยางสังเคราะห์ไม่ทิ้งคราบกาว ไม่ทำให้พื้นผิวเสียหาย\nติดได้ทั้งกระจก หรือโลหะ ป้องกันน้ำได้ดี ไม่มีซึม', 129, 'image/77.jpg'),
(1188, 'ชุดพู่กัน KINGORIGIN AB035 2 ชิ้น', 'ขนแปรงไม่หลุดร่วงขณะทาสี\nอุ้มสีได้ดี ทาได้พื้นที่มาก และเรียบเนียน\nด้ามจับกระชับมือ ทำงานง่าย และรวดเร็ว', 35, 'image/78.jpg'),
(1189, 'แปรงทาวานิช KINGORIGIN 3 นิ้ว', 'ขนแปรงไม่หลุดร่วงขณะทาสี\nอุ้มสีได้ดี ทาได้พื้นที่มาก และเรียบเนียน\nสำหรับงานทาสีเก็บรอยเก็บขอบ, งานทาสีเหนือหัว หรืองานพื้นที่ทาสีเฉพาะ เป็นต้น', 25, 'image/79.jpg'),
(1190, 'ลูกกลิ้งทาสีอะคริลิก ขนสั้น HACHI 4 นิ้ว', 'ล้างน้ำทำความสะอาดแล้วนำกลับมาใช้ซ้ำได้\nทาแล้วสีไม่กระเด็นเปรอะเปื้อน ไม่หยดย้อย\nเหมาะสำหรับพื้นที่เล็ก และแคบ หรืองานเก็บรอย', 79, 'image/80.jpg'),
(1191, 'ลูกกลิ้งทาสี EPOXY ขนยาว SOMIC 4 นิ้ว', 'ขนสังเคราะห์พิเศษ เหมาะสำหรับทาสี EPOXY โดยเฉพาะ\nขนยาวขนาด 14 มิลลิเมตร ด้วยขนที่ยาวสามารถส่งสีได้ดีในพื้นผิวที่ไม่เรียบ หรือขรุขระ\nด้ามแกนพลาสติกแข็งแรง สามารถถอดเปลี่ยนอะไหล่ได้ง่าย', 99, 'image/81.jpg'),
(1192, 'แปรงสีสร้างลาย ขนยาว POLYESTER#76', 'ขนแปรงมีความหนานุ่มอุ้มสีได้มาก\nการประกอบแน่นหนา ขนไม่หลุดง่าย\nเหมาะสำหรับงานทาสีหรือตกแต่งบ้าน', 160, 'image/82.jpg'),
(1193, 'สีน้ำมัน CAPTAIN #601 G 1/4GL', 'สีน้ำมันแอลขีดคุณภาพเยี่ยม\nPigment หรือผงสีของ Clariant จากประเทศเยอรมัน\nผงสีสำหรับแม่สีที่มีคุณภาพดีที่สุดเป็นที่ยอมรับทั่วโลก', 269, 'image/83.jpg'),
(1194, 'สีน้ำมัน TOA GLIPTON Base A เงา 1/4 แกลลอน', 'เนื้อสีมีความเข้มข้นสูง ให้เนื้อสีข้นมากพิเศษ ทาได้พื้นที่มากกว่า\nให้ผิวมันดุจเงาสะท้อนจากกระจก ทาได้พื้นที่มากกว่า\nปลอดภัยต่อสุขภาพ และสิ่งแวดล้อม ปราศจากสารอันตราย เช่น ปรอท และตะกั่ว', 199, 'image/84.jpg'),
(1195, 'THE SUN ลวดเชื่อมมิก 1.2 มม.', ' ผลิตจากสแตนเลสที่มีคุณภาพดี\n- ผ่านกระบวนการผลิตที่ทันสมัย\n- เหมาะสำหรับงานเชื่อมอลูมิเนียมทั่วไป เช่น ป้ายไฟ งานประติมากรรม โคมไฟ และหม้อน้ำรถยนต์ เป็นต้น\n- ใช้งานร่วมกับเครื่องเชื่อม\n- ลวดเชื่อมมิกใ', 900, 'image/85.jpg'),
(1196, 'THE SUN ลวดเชื่อมแก๊สทองแดง 3.2 มม.', 'มีความแข็งแรง ทนทาน สามารถใช้งานได้ยาวนาน\n- ต้านทานการแตกร้าวได้ดี\n- เหมาะใช้ในการเชื่อมซ่อมแซมชิ้นงานต่างๆ เช่น งานอุตสาหกรรมเครื่องปรับอากาศ ตู้เย็น เครื่องทำความเย็นและมีดกลึง\n- ลวดเชื่อมแก๊สทองแดง', 65, 'image/86.jpg'),
(1197, 'THE SUN หัวเชื่อม 500A เบอร์ 33', 'ผลิตจากสแตนเลสที่มีคุณภาพดี\n- ผ่านกระบวนการผลิตที่ทันสมัย\n- มีความแข็งแรง ทนทาน\n- หัวเชื่อมเหมาะสำหรับใช้กับตู้เชื่อมไฟฟ้า หัวเชื่อมไฟฟ้าใช้งานง่าย\n- ไม่เป็นสนิม ไม่เป็นอันตารยต่อร่างกาย\n- หัวเชื่อมไฟ', 295, 'image/87.jpg'),
(1198, 'YOSHINO แว่นตาเชื่อม 2 ชั้น รุ่น YLW-A018-3', 'เลนส์ผลิตจากโพลีคาร์บอเนต(Polycarbonate) แข็งแรง ทนทาน ให้ภาพชัดเหมือนจริง\n- สินค้าได้รับการรับรองมาตรฐาน\n- ไม่มีรอยแตกร้าว เคลือบสารป้องกันแสงได้ 99.9% เคลือบ Anti-scratch ป้องกันรอยขีดข่วน\n- สามารถร', 139, 'image/88.jpg'),
(1199, 'YOSHINO หน้ากากอ๊อก มือถือ รุ่น YLW-HF405', 'ผลิตจากเหล็กที่มีคุณภาพดี ผ่านกระบวนการผลิตที่ทันสมัย\n- โครงสร้างหน้ากากถูกออกแบบมาเพื่อปรับป้องกันดวงตาและใบหน้า\n- สามารถปรับระดับให้เหมาะสมกับศรีษะของผู้ใช้งาน\n- ป้องกันสะเก็ดจากงานเชื่อมไฟฟ้า\n- ปกป', 55, 'image/89.jpg'),
(1200, 'ข้อต่อสกรูตัวหนอน 5/8 นิ้ว(5ตัว)', 'ผลิตจากวัสดุคุณภาพดี\n- ผ่านกระบวนการผลิตด้วยเครื่องจักรที่ทันสมัย\n- มีความแข็งแรง ทนทาน ทนต่อการใช้งาน', 99, 'image/90.jpg'),
(1201, 'ข้อต่อสกรูตัวหนอน 1/2 นิ้ว(5 ตัว)', 'ผลิตจากวัสดุคุณภาพดี\n- ผ่านกระบวนการผลิตด้วยเครื่องจักรที่ทันสมัย\n- มีความแข็งแรง ทนทาน ทนต่อการใช้งาน', 60, 'image/91.jpg'),
(1202, 'NASH กบไสไม้ไฟฟ้า 3 นิ้ว รุ่น DS2824', 'กำลังไฟฟ้า : 750 วัตต์\n- กบไสไม้มีขนาดความยาว 3 นิ้ว\n- กบไสไม้ลิ่มทองเหลือง ตัวกบทำจากไม้เนื้อแข็ง\n- ใช้สำหรับไสไม้ละเอียด ปรับแต่งผิวไม้\n- กบไสไม้ลิ่มทองเหลืองใช้งานร่วมกับ ใบมีดของกบไสไม้\n- มีน้ำหนั', 1650, 'image/92.jpg'),
(1203, 'NASH คีมจับสายดิน 300 แอมป์', 'จุดเชื่อมสายดิน และปากคีม ผลิตจากทองแดง 100% จึงมีประสิทธิภาพในการไหลของกระแสไฟได้อย่างดีเยี่ยม\n- ออกแบบปากคีมให้สามารถยึดจับชิ้นงานหรือโต๊ะเชื่อมได้อย่างหนาช่วยให้กระแสไฟไหลอย่างต่อเนื่อง งานเชื่อมไม', 90, 'image/93.jpg'),
(1204, 'WHITCO บานพับเหล็กบรอนด์ ขนาด 3.5 นิ้ว รุ่น WFHB (แพ็ค3ชิ้น)', 'ผลิตจากวัสดุที่มีคุณภาพดี มีความหนาและแข็งแรงเป็นพิเศษ\n- มีขนาดที่ได้มาตรฐาน สามารถรองรับน้ำหนักและต้านทานการเสียดได้เป็นอย่างดี\n- เปิด-ปิดได้คล่อง ไม่มีเสียงดัง ไม่ฝืดและไม่ทรุดง่ายไม่เป็นสนิม\n- มีขบ', 60, 'image/94.jpg'),
(1205, 'NASH แผ่นตัดเหล็ก ขนาด 14 นิ้ว', 'แผ่นตัดเหล็ก(CUTTING DISC) ผลิตจากเม็ดทรายอลูมินั่มออกไซด์(Aluminum Oxide A) ที่มีความคม แข็งแรง\n- ใช้งานร่วมกับเครื่องตัดไฟเบอร์\n- โครงสร้างผลิตจากเส้นใยไฟเบอร์ที่มีความเหนียวพิเศษ\n- เหมาะสำหรับตัดเห', 65, 'image/95.jpg'),
(1206, 'ถังปูน พลาสติก SPOA สีดำ', 'เหมาะสำหรับบรรจุน้ำ หรือปูนในงานก่อสร้าง\nผ่านกระบวนการผลิตด้วยเครื่องจักรที่ได้มาตรฐาน\nหูหิ้วพลาสติกเนื้อแข็ง เพื่อควา', 39, 'image/96.jpg'),
(1207, 'ปูนเสือ ซีเมนต์ ปูนซีเมนต์ผสม ก่อ ฉาบ เท สูตรเนื้อแน่น', 'ปูนซีเมนต์ผสม เหมาะสำหรับงานก่ออิฐและฉาบผนัง ผนังที่ได้แข็งแรง ไม่แตกร้าว เนื่องจากเนื้อปูน ยึดเกาะได้ดีและยืดหดตัวน้อย นอกจากนี้ยังใช่ในงานโครงสร้างขนาดเล็กได้', 120, 'image/97.jpg'),
(1208, 'ปูนซีเมนต์งานโครงสร้าง SCG ปูนช้างแดง (ถุง 50 กก.)', 'ปูนงานโครงสร้าง SCG ปูนช้างแดง เป็นปูนซีเมนต์ปอร์ตแลนด์ประเภท 1 มีคุณสมบัติให้กำลังอัดสูง เหมาะสำหรับงานโครงสร้างที่ต้องการความแข็งแรงสูง ตัวอย่างเช่น ฐานรา เสา คาน พื้น ของบ้านพักอาศัย อาคารทั่วไป แล', 109, 'image/98.jpg'),
(1209, 'ปูนงานโครงสร้าง SCG สูตรไฮบริด (ปูนซีเมนต์ถุง 50 กก.)', 'ปูนงานโครงสร้าง SCG สูตรไฮบริด เป็นปูนซีเมนต์ไฮดรอลิกชนิดใช้งานทั่วไป GU สูตรพิเศษ ผ่านการคิดค้นด้วยหลักวัสดุศาสตร์ Materials Science และเทคโนโลยีการผลิตมาตรฐานใหม่ Hybrid Technology มีส่วนประกอบจากปู', 110, 'image/99.jpg'),
(1210, 'ปูนรับกำลังอัดเร็ว SCG (ถุง 50 กก.)', 'ปูนรับกำลังอัดเร็ว เอสซีจี ปูนซีเมนต์ปอร์ตแลนด์ประเภท 3 เหมาะสำหรับคอนกรีตสำเร็จรูปชนิดอัดแรง อาทิ แผ่นพื้น เสาเข็ม เสาไฟฟ้า ชั้นถุงพลาสติก ป้องกันความชื้นและทนต่อแรงกระแทก รักษาคุณภาพปูนให้สดใหม่เสมอ', 115, 'image/100.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `purchase`
--

CREATE TABLE `purchase` (
  `MID` int(10) NOT NULL,
  `OrderID` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `shipping`
--

CREATE TABLE `shipping` (
  `SID` int(8) NOT NULL,
  `OrderID` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `shop`
--

CREATE TABLE `shop` (
  `SID` int(8) NOT NULL,
  `Sname` varchar(100) DEFAULT NULL,
  `address` varchar(200) DEFAULT NULL,
  `phone` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `shop`
--

INSERT INTO `shop` (`SID`, `Sname`, `address`, `phone`) VALUES
(14501, 'ปลวกแดงวัสดุก่อสร้าง', '415 หมู่ 5 ตำบลแม่น้ำคู้ อำเภอปลวกแดง ระยอง 21140', '959632288'),
(14503, 'ห้างหุ้นส่วนจำกัด อ อุไร คอนสตรัคชั่น', '83/14 หมู่ 3 ซอย 26 ถนนรังสิต-นครนายก ตำบลประชาธิปัตย์ อำเภอธัญบุรี จังหวัดปทุมธานี 12130 ', '29929190'),
(14505, 'ห้างหุ้นส่วนจำกัด วงศ์สุริยะ ก่อสร้าง 1989', '832 หมู่ 11 ถนนมิตรสัมพันธ์ ตำบลสูงเนิน อำเภอสูงเนิน จังหวัดนครราชสีมา 30170 ', '44419120'),
(14507, 'ร้าน วิวัฒน์ วัสดุก่อสร้าง', '119/1 ถนนท่าเมือง ตำบลเขานิเวศน์ อำเภอเมืองระนอง จังหวัดระนอง 85000', '77811529'),
(14509, 'บริษัท ยุ่ยล้งนคร จำกัด', ' 82/41 ถนนพัฒนาการคูขวาง ตำบลคลัง อำเภอเมืองนครศรีธรรมราช จังหวัดนครศรีธรรมราช 80000 ', '753174334'),
(14511, 'หจก สุขภัณฑ์ปูนการช่าง', '415 ถนนท้าวสุระ ตำบลในเมือง อำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา 30000 ', '44243247'),
(14513, 'ร้าน วรรณ์วัสดุก่อสร้าง', '105 หมู่ 12 ตำบลบ้านพร้าว อำเภอบ้านนา จังหวัดนครนายก 26110', '37381795'),
(14515, 'ร้าน เชี่ยวชาญวัสดุก่อสร้าง', '634/1 ถนนบางขุนเทียน-ชายทะเล แขวงท่าข้าม เขตบางขุนเทียน กรุงเทพมหานคร 10150', '289745567'),
(14517, 'ทรัพย์อนันต์โลหะกิจ', '43/27 ถนนไสวประชาราษฎร์ ตำบลลาดสวาย  อำเภอลำลูกกา จังหวัดปทุมธานี 12150 ', '21991255'),
(14519, 'ห้างหุ้นส่วนจำกัด พูนลาภ อินเตอร์เทรด', '131/162 ซอย 65 ถนนรังสิต-นครนายก ตำบลประชาธิปัตย์ อำเภอธัญบุรี จังหวัดปทุมธานี 12130', '25499343'),
(14521, 'บริษัท ภัทรไพบูลย์ภัณฑ์ จำกัด', '118 ถนนศูนย์ศิลปาชีพบางไทร-ปทุมธานี ตำบลเชียงรากใหญ่ อำเภอสามโคก จังหวัดปทุมธานี 12160 ', '29750440'),
(14523, 'ร้าน จารุทรัพย์วัสดุก่อสร้าง', '1/5 หมู่ 8 ถนนเลียบคลองแปด ตำบลลำลูกกา อำเภอลำลูกกา จังหวัดปทุมธานี 12150', '819882460'),
(14525, 'ห้างหุ้นส่วนจำกัด ช.ชัยเจริญ วัสดุก่อสร้าง', '43 หมู่ 15 ตำบลบึงคำพร้อย อำเภอลำลูกกา จังหวัดปทุมธานี 12150', '969342260'),
(14527, 'ร้าน ป้าอุบล วัสดุก่อสร้าง', '52/3 หมู่ 1 ซอยบ้านปากอาจ ถนนปทุมธานี-บางปะหัน ตำบลเชียงรากน้อย อำเภอสามโคก จังหวัดปทุมธานี 12160', '816498945'),
(14529, 'ร้าน ศรีรักษ์ วัสดุก่อสร้าง', '5/8 หมู่ 9 ถนนลำลูกกาเลียบคลอง 3 ตำบลลาดสวาย อำเภอลำลูกกา จังหวัดปทุมธานี 10150', '21528459'),
(14531, 'ร้าน วิชัยค้าไม้วัสดุก่อสร้าง', '98/1-2 หมู่ 7 ตำบลลาดสวาย อำเภอลำลูกกา จังหวัดปทุมธานี 12150', '29944754'),
(14533, 'บริษัท เอ็ม แอนด์ อี วัสดุก่อสร้าง จำกัด', '505/1-2 ซอยพหลโยธิน 48 แขวงอนุสาวรีย์ เขตบางเขน กรุงเทพมหานคร 10220', '29004022'),
(14535, 'ร้าน จงเจริญพาณิชย์', '912-914 ถนนพหลโยธิน แขวงจอมพล เขตจตุจักร กรุงเทพมหานคร 10900 ', '22725701'),
(14537, 'ห้างหุ้นส่วนจำกัด เอี่ยม เทรดดิ้ง กรุ๊ป', '241/20 ถนนกาญจนาภิเษก 0015 แขวงศาลาธรรมสพน์ เขตทวีวัฒนา กรุงเทพมหานคร 10170 ', '28852366'),
(14539, 'บริษัท เอ.พี.เอ็น. ฮาร์ดแวร์ จำกัด', '123/65 ถนนฉลองกรุง แขวงลำปลาทิว เขตลาดกระบัง กรุงเทพมหานคร 10520', '23166322'),
(14541, 'ร้าน ศ วัสดุก่อสร้าง', '294 ซอย 40 ถนนรามคำแหง แขวงหัวหมาก เขตบางกะปิ กรุงเทพมหานคร 10240', '27363096'),
(14543, 'ร้าน ภักดีกุลวัสดุก่อสร้าง', '45/7 หมู่ 7 ถนนสุวินทวงศ์ แขวงแสนแสบ เขตมีนบุรี กรุงเทพมหานคร 10510', '29149948'),
(14545, 'ร้าน คู้บอนวัสดุก่อสร้าง', '129 ถนนคู้บอน แขวงรามอินทรา เขตคันนายาว กรุงเทพมหานคร 10230', '29433104'),
(14547, 'ร้าน ป วัสดุก่อสร้าง', '525/2 หมู่ 2 ซอย 20 ถนนเพิ่มสิน แขวงคลองถนน เขตสายไหม กรุงเทพมหานคร 10220', '25316109'),
(14549, 'บริษัท ไทยเจริญค้าไม้และวัสดุก่อสร้าง จำกัด', '45/11-2 หมู่ 4 ถนนปิ่นเกล้า-นครชัยศรี แขวงฉิมพลี เขตตลิ่งชัน กรุงเทพมหานคร 10170', '28841381'),
(14551, 'ร้าน เจริญผลค้าวัสดุก่อสร้าง', '511 ซอย 117 ถนนประชาอุทิศ แขวงทุ่งครุ เขตทุ่งครุ กรุงเทพมหานคร 10140', '24633049'),
(14553, 'ร้าน วิเชียรค้าวัสดุก่อสร้าง', '939-40 ถนนรามอินทรา แขวงท่าแร้ง เขตบางเขน กรุงเทพมหานคร 10220', '25104435'),
(14555, 'บริษัท เจริญชัยค้าวัสดุ จำกัด', 'ถนนเจ้าคุณทหาร แขวงลำปลาทิว เขตลาดกระบัง กรุงเทพมหานคร 10520', '27373555'),
(14557, 'ร้าน สุนทรวาณิชย์', '240 ถนนรามอินทรา แขวงคันนายาว  เขตคันนายาว กรุงเทพมหานคร 10230 ', '818680266'),
(14559, 'บริษัท ส สิทธิพรรุ่งเรือง จำกัด', '51/5 หมู่ 7 ถนนราษฎร์พัฒนา แขวงสะพานสูง เขตสะพานสูง กรุงเทพมหานคร 10240', '29172701'),
(14561, 'บริษัท 88 โซลูชั่น จำกัด', '552/280 ซอยวัดไผ่เงิน ถนนจันทร์ แขวงบางโคล่ เขตบางคอแหลม กรุงเทพมหานคร 10120', '26730002'),
(14563, 'บริษัท เก้าดาวทอง เชียง เฮง จำกัด', '35/33 หมู่ 13 ซอย 35 ถนนจรัญสนิทวงศ์ แขวงบางพรม เขตตลิ่งชัน กรุงเทพมหานคร 10170', '894532677'),
(14565, 'ห้างหุ้นส่วนจำกัด เชียงใหม่วีระกิจ', '534/1 ซอยสุขโข ถนนสุทธิสารวินิจฉัย แขวงห้วยขวาง เขตห้วยขวาง กรุงเทพมหานคร 10310', '26934271'),
(14567, 'บริษัท ศ ศ กังวาน จำกัด', '398 ถนนรามอินทรา แขวงท่าแร้ง เขตบางเขน กรุงเทพมหานคร 10230', '990473299'),
(14569, 'ร้าน พ ศิริวัสดุก่อสร้าง', '131/3 ห ถนนเลียบมอเตอร์เวย์ แขวงสะพานสูง เขตสะพานสูง กรุงเทพมหานคร 10240', '27358282'),
(14571, 'ร้าน ชัยเจริญวัสดุก่อสร้าง', '36 ซอย 101 ถนนลาดพร้าว แขวงคลองจั่น เขตบางกะปิ กรุงเทพมหานคร 10240', '29497179'),
(14573, 'ร้าน พันทองวัสดุก่อสร้าง', '623/33 ถนนรามคำแหง 123 แขวงหัวหมาก เขตบางกะปิ กรุงเทพมหานคร 10240', '23763320'),
(14575, 'ร้าน แสงเจริญวัสดุก่อสร้าง', '99 ซอย 20 มิถุนา ถนนประชาราษฎร์บำเพ็ญ แขวงห้วยขวาง เขตห้วยขวาง กรุงเทพมหานคร 10310', '26911206'),
(14577, 'ร้าน รัตนชัยวัสดุก่อสร้าง', '211 ซอย 1 ถนนแขวงบางบอน แขวงบางบอน เขตบางบอน กรุงเทพมหานคร 10150', '24152853'),
(14579, 'บริษัท บี เอ็ม ที (ไทยแลนด์) จำกัด', '70/147-8 ซอยรามคำแหง 176 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510', '816261451'),
(14581, 'บริษัท ส สิทธิพรรุ่งเรือง จำกัด', '74 ถนนราษฎร์พัฒนา แขวงสะพานสูง เขตสะพานสูง กรุงเทพมหานคร 10240', '29171168'),
(14583, 'ห้างหุ้นส่วนจำกัด ไทยร่วมเจริญค้าวัสดุก่อสร้าง', '10 ถนนกัลปพฤกษ์ แขวงบางแค เขตบางแค กรุงเทพมหานคร 10160', '24548415'),
(14585, 'ร้าน ธำรงชัยค้าวัสดุก่อสร้าง', '28/36-7 ถนนเพชรเกษม แขวงวัดท่าพระ เขตบางกอกใหญ่ กรุงเทพมหานคร 10600', '24652118'),
(14587, 'ร้าน เฉลิมชัย ค้าวัสดุก่อสร้าง', '964-964/1 ถนนกรุงเกษม แขวงวัดโสมนัส เขตป้อมปราบศัตรูพ่าย กรุงเทพมหานคร 10100', '22813027'),
(14589, 'ร้าน กม 8 ค้าวัสดุ ก่อสร้าง', '25 ถนนนวมินทร์ แขวงรามอินทรา เขตคันนายาว กรุงเทพมหานคร 10230', '25103458'),
(14591, 'บริษัท สยามวินเนอร์ 2014 จำกัด', '221 ถนนเพชรเกษม 84 แขวงบางแคเหนือ เขตบางแค กรุงเทพมหานคร 10160', '24547648'),
(14593, 'บริษัท ศรีจิตวัสดุภัณฑ์ จำกัด', '68/88 ถนนเพิ่มสิน แขวงสายไหม เขตสายไหม กรุงเทพมหานคร 10220', '865089188'),
(14595, 'ร้าน เจริญสินชัยค้าวัสดุก่อสร้าง', '67/6 ถนนประชาสุข แขวงดินแดง เขตดินแดง กรุงเทพมหานคร 10400', '26936193'),
(14597, 'ร้าน พ นำชัยค้าวัสดุก่อสร้าง', '69 ถนนรามอินทรา แขวงรามอินทรา เขตคันนายาว กรุงเทพมหานคร 10230', '25082281'),
(14599, 'บริษัท เครื่องก่อสร้าง (1983) จำกัด', '325, 327, 329 ถนนรามอินทรา แขวงอนุสาวรีย์ เขตบางเขน กรุงเทพมหานคร 10220', '25210620'),
(14601, 'สายสองค้าไม้', '192 ถนนศาลาธรรมสพน์ 6 แขวงศาลาธรรมสพน์ เขตทวีวัฒนา กรุงเทพมหานคร 10170', '28851960'),
(14603, 'บริษัท วิน วิน เวิร์คส์ (2002) จำกัด', '64 ซอย 69 ถนนโชคชัย 4 แขวงลาดพร้าว เขตลาดพร้าว กรุงเทพมหานคร 10230', '25399990'),
(14605, 'บริษัท แคนตั้น เทรดดิ้ง จำกัด', '7/1 ถนนเจริญกรุง 80 แขวงบางคอแหลม เขตบางคอแหลม กรุงเทพมหานคร 10120', '22891549'),
(14607, 'บริษัท สุธาพร ค้าวัสดุ จำกัด', '2/4 หมู่ 7 ตำบลโป่ง อำเภอบางละมุง จังหวัดชลบุรี 20150 ', '38227230'),
(14609, 'สมพิศ ค้าเหล็ก พิษณุโลก', '395 หมู่ 7 ตำบลบึงพระ อำเภอเมืองพิษณุโลก จังหวัดพิษณุโลก 65000 ', '810387395'),
(14611, 'ห้างหุ้นส่วนจำกัด สินพัฒนา ค้าวัสดุก่อสร้าง', '199/17 หมู่ 3 ตำบลบึง อำเภอศรีราชา จังหวัดชลบุรี 20230 ', '962695356'),
(14613, 'ห้างหุ้นส่วนจำกัด ปราณบุรีค้าไม้ (กำพล)', '308/1 หมู่ 12 ถนนเพชรเกษม ตำบลหนองตาแต้ม อำเภอปราณบุรี จังหวัดประจวบคีรีขันธ์ 77120 ', '32621839'),
(14615, 'ลี้ย่งเส็งเทรดดิ้ง', '64/1 หมู่ 3 ตำบลนิคมพัฒนา อำเภอนิคมพัฒนา จังหวัดระยอง 21180 ', '816537691'),
(14617, 'บริษัท ศิริเจริญ โฮมสแตนดาร์ด จำกัด', '51 หมู่ 1 ถนนตากสิน ตำบลท่าช้าง อำเภอเมืองจันทบุรี จังหวัดจันทบุรี 22000 ', '394985859'),
(14619, 'บริษัท เจริญวัฒน์โลหะกิจ จำกัด', '292294296 ถนนธรรมนูญวิถี ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110 ', '74232862'),
(14621, 'บริษัท ทองไทย เมทอล เทรดดิ้ง จำกัด', '199/4 หมู่ 6 ถนนสุขุมวิท ตำบลทุ่งควายกิน อำเภอแกลง จังหวัดระยอง 21110 ', '864583846'),
(14623, 'บุญชัยคอนกรีต', '218/1 หมู่ 1 ถนนสวรรค์วิถี ตำบลนครสวรรค์ตก อำเภอเมืองนครสวรรค์ จังหวัดนครสวรรค์ 60000 ', '56883396'),
(14625, 'ร้านนุรักษ์วรรณ', '102/7 หมู่ 6 ตำบลทับมา อำเภอเมืองระยอง จังหวัดระยอง 21000 ', '38034244'),
(14627, 'ร้าน ชูชาติค้าไม้ 2 ', '1184/12 ถนนเพชรเกษม ฝั่งทิศตะวันตก ตำบลชะอำ อำเภอชะอำ จังหวัดเพชรบุรี 76120 ', '858128180'),
(14629, 'บริษัท เจริญเคหะ โฮมมาร์ท จำกัด', '54/55 หมู่ 1 ถนนริมน้ำ ตำบลจันทนิมิต อำเภอเมืองจันทบุรี จังหวัดจันทบุรี 22000 ', '39311781'),
(14631, 'ห้างหุ้นส่วนจำกัด เจริญกรุง ค้าวัสดุ', '254 ซอยเจริญกรุง 93 แยก 7 แขวงวัดพระยาไกร  เขตบางคอแหลม กรุงเทพมหานคร 10120 ', '22890492'),
(14633, 'บริษัท พัทลุงสิทธิชัยวัสดุก่อสร้าง จำกัด', '210212 ถนนราเมศวร์ ตำบลคูหาสวรรค์ อำเภอเมืองพัทลุง จังหวัดพัทลุง 93000', '746152235'),
(14635, 'ดวงใจวัสดุก่อสร้าง', '345 หมู่ 1 ถนนโล่ห์สุวรรณ ตำบลสังขะ  อำเภอสังขะ จังหวัดสุรินทร์ 32150 ', '44571051'),
(14637, 'ร้านสมเกียรติพานิช', '65/2-3 หมู่ 1 ถนนสระบุรี-หล่มสัก ตำบลดีลัง อำเภอพัฒนานิคม จังหวัดลพบุรี 15220 ', '818020772'),
(14639, 'ห้างหุ้นส่วนจำกัด เสลภูมิค้าไม้ (ฮ่วงเซ้ง)', '83/1-5 หมู่ 8 ตำบลกลาง อำเภอเสลภูมิ จังหวัดร้อยเอ็ด 45120 ', '43551301'),
(14641, 'บริษัท ชลบุรี พี เจ พาณิชย์ จำกัด', '276/1-2 หมู่ 6 ตำบลบ่อวิน อำเภอศรีราชา จังหวัดชลบุรี 20230 ', '38345197'),
(14643, 'หจก สุขภัณฑ์ปูนการช่าง', 'ถนนท้าวสุระ ตำบลในเมือง อำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา 30000 ', '44243247'),
(14645, 'ห้างหุ้นส่วนจำกัด ท่ายางค้าไม้', '157/10 หมู่ 5 ตำบลท่ายาง อำเภอท่ายาง จังหวัดเพชรบุรี 76130 ', '32461533'),
(14647, 'โรงงานสิทธิพร เครื่องมือก่อสร้าง นครปฐม', '23/185 หมู่ 8 ถนนอ้อมใหญ่ ตำบลอ้อมใหญ่ อำเภอสามพราน จังหวัดนครปฐม 73160', '813331788'),
(14649, 'ห้างหุ้นส่วนจำกัด กิจพนาค้าไม้', '839 หมู่ 11 ตำบลสูงเนิน อำเภอสูงเนิน จังหวัดนครราชสีมา 30170 ', '44419390'),
(14651, 'ห้างหุ้นส่วนจำกัด ล. ฮั่วฮวดเส็งค้าไม้', '611 หมู่ 3 ตำบลศรีประจันต์ อำเภอศรีประจันต์ จังหวัดสุพรรณบุรี 72140 ', '35581062'),
(14653, 'บริษัท ส. เอื้อสุข จำกัด', '179/2 หมู่ 3 ถนนแสงชูโต ตำบลทุ่งทอง อำเภอท่าม่วง จังหวัดกาญจนบุรี 71110 ', '819164747'),
(14655, 'สุรชา ฮาร์ดแวร์ สโตร์', 'ถนนมิตรภาพ ตำบลแก่งคอย อำเภอแก่งคอย จังหวัดสระบุรี 18110 ', '36241428'),
(14657, 'ห้างหุ้นส่วนจำกัด ปป ก่อสร้าง 27', 'ถนนเทศบาล 4 ตำบลขลุง อำเภอขลุง จังหวัดจันทบุรี 22110 ', '39441270'),
(14659, 'ห้างหุ้นส่วนจำกัด บุญไทยวัสดุก่อสร้าง', 'ข/1 306/14 ถนนสุวรรณศร ตำบลนครนายก อำเภอเมืองนครนายก จังหวัดนครนายก 26000 ', '37311008'),
(14661, 'ห้างหุ้นส่วนจำกัด ราชสีมาค้าเหล็ก', '339 หมู่ 11 ตำบลจอหอ อำเภอเมืองนครราชสีมา จังหวัดนครราชสีมา 30130 ', '885864002'),
(14663, 'บริษัท เกียรติเจริญหาดใหญ่ โลหะภัณฑ์ จำกัด', '88/8 ถนนกาญจนวณิชย์ ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110 ', '74212888'),
(14665, 'ร้าน ถาวรไทยวัสดุ', '800/6-8 ซอยเจริญกรุง 107 ถนนเจริญกรุง แขวงบางโคล่ เขตบางคอแหลม กรุงเทพมหานคร 10120 ', '26886125'),
(14667, 'บริษัท หินกองวัสดุก่อสร้าง จำกัด', '1/8 หมู่ 4 ถนนพหลโยธิน ตำบลห้วยทราย อำเภอหนองแค จังหวัดสระบุรี 18230 ', '882551823'),
(14669, 'บริษัท นพเก้า โฮมมาร์ท จำกัด', '96 หมู่ 13 ถนนสุรินทร์-ปราสาท ตำบลเฉนียง อำเภอเมืองสุรินทร์ จังหวัดสุรินทร์ 32000', '44713933'),
(14671, 'บริษัท ภัทรไพบูลย์ภัณฑ์ จำกัด ', '118 ถนนศูนย์ศิลปาชีพบางไทร-ปทุมธานี ตำบลเชียงรากใหญ่ อำเภอสามโคก จังหวัดปทุมธานี 12160 ', '29750440'),
(14673, 'ห้างหุ้นส่วนจำกัด กวางทองค้าไม้ 1994', '76/1-4 ตำบลขลุง อำเภอขลุง จังหวัดจันทบุรี 22110 ', '39441336'),
(14675, 'บริษัท เชียงใหม่รู้ใจช่าง จำกัด', '08 หมู่ 7 ถนนวงแหวนที่ 2 ตำบลแม่เหียะ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50100', '53447653'),
(14677, 'ร้าน ทรัพย์มงคล', '126/3 หมู่ 8 ซอยหมอย้อย ตำบลสุรศักดิ์ อำเภอศรีราชา จังหวัดชลบุรี 20110 ', '38321843'),
(14679, 'หลังสวนซีแพค', '132 หมู่ 11 ตำบลวังตะกอ อำเภอหลังสวน จังหวัดชุมพร 86110 ', '77653255'),
(14681, 'บริษัท พงศ์เพชรคลังวัสดุก่อสร้าง จำกัด', '177 หมู่ 7 ถนนมิตรภาพ ตำบลปากช่อง อำเภอปากช่อง จังหวัดนครราชสีมา 30130 ', '622014350'),
(14683, 'บริษัท ภูเก็ต โชคโยธาวัสดุภัณฑ์ จำกัด', '2/5 หมู่ 6 ถนนเจ้าฟ้าตะวันตก ตำบลฉลอง อำเภอเมืองภูเก็ต จังหวัดภูเก็ต 83130 ', '864792736'),
(14685, 'ศศิธรค้าวัสดุภัณฑ์', '43/2 หมู่ 1 ถนนพหลโยธิน ตำบลนายาว อำเภอพระพุทธบาท จังหวัดสระบุรี 18120 ', '36239618'),
(14687, 'ห้างหุ้นส่วนจำกัด เยี่ยมไพศาลก่อสร้าง', '12/1 หมู่ 5 ถนนเชียงใหม่-สันกำแพง ตำบลท่าศาลา อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ 50000 ', '819500926'),
(14689, 'ห้างหุ้นส่วนจำกัด ต ชัยเจริญฮาร์ดแวร์', '25/10 หมู่ 2 ตำบลนามะตูม อำเภอพนัสนิคม จังหวัดชลบุรี 20140 ', '38462974'),
(14691, 'บริษัท เอี่ยมเส็ง 2003 จำกัด', '456/1 หมู่ 2 ถนนชุมแพ-ภูเขียว ตำบลชุมแพ อำเภอชุมแพ จังหวัดขอนแก่น 40130', '43312092'),
(14693, 'เครื่องมือก่อสร้าง ญดา อินเตอร์', '99/9, 99/10 หมู่ 21 ตำบลลำลูกกา อำเภอลำลูกกา จังหวัดปทุมธานี 12150', '881947999'),
(14695, 'ห้างหุ้นส่วนจำกัด นครสวรรค์เต็กเซ่งฮง', 'คลังสินค้า อำเภอเมืองนครสวรรค์ จังหวัดนครสวรรค์ 60000', '56275855'),
(14697, 'บริษัท บ้านอำเภอ เทรดดิ้ง จำกัด', 'ศูนย์บริการเอสซีจี โฮมโซลูชั่น เซ็นเตอร์ ตำบลนาจอมเทียน อำเภอสัตหีบ จังหวัดชลบุรี 20250', '38235272'),
(14699, 'ราชาวัสดุ-ค้าไม้', 'สาขาในตลาด ตำบลตระการ อำเภอตระการพืชผล จังหวัดอุบลราชธานี 34130', '45481102');

-- --------------------------------------------------------

--
-- Table structure for table `warehouse`
--

CREATE TABLE `warehouse` (
  `PID` int(8) NOT NULL,
  `SID` int(8) NOT NULL,
  `NA_Amount` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `warehouse`
--

INSERT INTO `warehouse` (`PID`, `SID`, `NA_Amount`) VALUES
(1111, 14501, 43),
(1112, 14501, 19),
(1113, 14501, 50),
(1114, 14501, 77),
(1115, 14501, 24),
(1116, 14501, 95),
(1117, 14501, 49),
(1118, 14501, 23),
(1119, 14501, 6),
(1120, 14501, 35),
(1121, 14501, 2),
(1122, 14501, 38),
(1123, 14501, 94),
(1124, 14501, 7),
(1125, 14501, 94),
(1126, 14501, 94),
(1127, 14501, 85),
(1128, 14501, 12),
(1129, 14501, 5),
(1130, 14523, 55),
(1131, 14523, 87),
(1132, 14523, 34),
(1133, 14523, 70),
(1134, 14523, 55),
(1135, 14523, 30),
(1136, 14523, 84),
(1137, 14523, 7),
(1138, 14533, 55),
(1139, 14533, 4),
(1140, 14533, 76),
(1141, 14533, 45),
(1142, 14533, 13),
(1143, 14533, 40),
(1144, 14533, 18),
(1145, 14533, 45),
(1146, 14533, 32),
(1147, 14533, 93),
(1148, 14533, 0),
(1149, 14533, 100),
(1150, 14533, 39),
(1151, 14533, 43),
(1152, 14533, 12),
(1153, 14543, 2),
(1154, 14543, 92),
(1155, 14543, 49),
(1156, 14543, 39),
(1157, 14543, 23),
(1158, 14543, 74),
(1159, 14543, 24),
(1160, 14543, 81),
(1161, 14543, 82),
(1162, 14543, 90),
(1163, 14543, 27),
(1164, 14579, 45),
(1165, 14579, 45),
(1166, 14579, 76),
(1167, 14579, 67),
(1168, 14579, 49),
(1169, 14579, 56),
(1170, 14579, 67),
(1171, 14579, 38),
(1172, 14579, 42),
(1173, 14579, 85),
(1174, 14579, 79),
(1175, 14579, 98),
(1176, 14579, 36),
(1177, 14579, 78),
(1178, 14579, 89),
(1179, 14579, 82),
(1180, 14579, 64),
(1181, 14579, 63),
(1182, 14589, 52),
(1183, 14589, 10),
(1184, 14589, 29),
(1185, 14589, 0),
(1186, 14589, 11),
(1187, 14589, 89),
(1188, 14589, 1),
(1189, 14589, 58),
(1190, 14589, 61),
(1191, 14589, 57),
(1192, 14589, 12),
(1193, 14589, 59),
(1194, 14589, 21),
(1195, 14589, 24),
(1196, 14589, 24),
(1197, 14589, 83),
(1198, 14589, 72),
(1199, 14589, 50),
(1200, 14589, 95),
(1201, 14589, 87),
(1202, 14589, 21),
(1203, 14589, 6),
(1204, 14589, 92),
(1205, 14589, 65),
(1206, 14589, 51),
(1207, 14589, 44),
(1208, 14693, 45),
(1209, 14693, 65),
(1210, 14693, 69);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`PID`,`OrderID`),
  ADD KEY `OrderID` (`OrderID`);

--
-- Indexes for table `company`
--
ALTER TABLE `company`
  ADD PRIMARY KEY (`MID`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`MID`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`OrderID`);

--
-- Indexes for table `person`
--
ALTER TABLE `person`
  ADD PRIMARY KEY (`MID`);

--
-- Indexes for table `purchase`
--
ALTER TABLE `purchase`
  ADD KEY `OrderID` (`OrderID`),
  ADD KEY `MID` (`MID`);

--
-- Indexes for table `shipping`
--
ALTER TABLE `shipping`
  ADD KEY `SID` (`SID`),
  ADD KEY `OrderID` (`OrderID`);

--
-- Indexes for table `shop`
--
ALTER TABLE `shop`
  ADD PRIMARY KEY (`SID`);

--
-- Indexes for table `warehouse`
--
ALTER TABLE `warehouse`
  ADD PRIMARY KEY (`PID`,`SID`),
  ADD KEY `SID` (`SID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cart`
--
ALTER TABLE `cart`
  MODIFY `OrderID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `company`
--
ALTER TABLE `company`
  MODIFY `MID` int(8) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `member`
--
ALTER TABLE `member`
  MODIFY `MID` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `OrderID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `person`
--
ALTER TABLE `person`
  MODIFY `MID` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
